var prompts =
{
    "Sentiment Analysis": [
        {
            "inputs": "هل مشاعر الجملة التالية سلبية ، إيجابية ، أم محايدة : ###",
            "targets": "مشاعر الجملة السابقة ###.",
        },
        {
            "inputs": "لدينا الجملة التالية: ###. ماهي مشاعر الجملة السابقة؟",
            "targets": "الجملة السابقة تحتوي على مشاعر ###.",
        },
        {
            "inputs": "### ماهي مشاعر التغريدة السابقة؟",
            "targets": "التغريدة تحتوي على مشاعر ###.",
        },
        {
            "inputs": "كنت أقرأ في تويتر ووجدت الجملة التالية '###'. هل التغريدة السابقة إيجابية سلبية او محايدة؟",
            "targets": "التغريدة السابقة تعبر عن مشاعر ###.",
        },
        {
            "inputs": "إقرأ التغريدة التالية ###. ثم حلل مشاعرها.",
            "targets": "المشاعر في التغريدة السابقة ###.",
        },
    ],
    "Review Classification": [
        {
            "inputs": "هل مشاعر الجملة التالية سلبية ، إيجابية ، أم محايدة : ###",
            "targets": "مشاعر الجملة السابقة ###.",
        },
        {
            "inputs": "لدينا الجملة التالية: ###. ماهي مشاعر الجملة السابقة؟",
            "targets": "الجملة السابقة تحتوي على مشاعر ###.",
        },
        {
            "inputs": "### ماهي مشاعر المراجعة السابقة؟",
            "targets": "الجملة تحتوي على مشاعر ###.",
        },
        {
            "inputs": "كنت أقرأ في مراجعة ووجدت الجملة التالية '###'. هل المراجعة السابقة إيجابية سلبية او محايدة؟",
            "targets": "المراجعة السابقة تعبر عن مشاعر ###.",
        },
        {
            "inputs": "إقرأ المراجعة التالية ###. ثم حلل مشاعرها.",
            "targets": "المشاعر في المراجعة السابقة ###.",
        }
    ],
    "Question Answering": [
        {
            "inputs": "أجب على السؤال التالي : ###",
            "targets": "الإجابة الصحيحة هي ###."
        },
        {
            "inputs": "لدينا السؤال التالي: ### ، أجب عليه بطريقة مختصرة.",
            "targets": "حسناً، الإجابة هي ###",
        },
        {
            "inputs": "### أجب على السؤال السابق.",
            "targets": "الإجابة هي: ###",
        },
        {
            "inputs": "قم بالإجابة على السؤال التالي ###",
            "targets": "بالتأكيد، الإجابة هي ###.",
        },
        {
            "inputs": "وجدت هذا السؤال: ### في موقع ثقافي ، ماهي الإجابة؟",
            "targets": "الإجابة على السؤال هي ###.",
        }, {
            "inputs": "لدي هذا السؤال ### ، أجب عليه بطريقة مبسطة.",
            "targets": "حسناً. الإجابة هي ###.",
        },
        {
            "inputs": "بحثت في الإنترنت عن إجابة لهذا السؤال ###. لكني لم أجد إجابة ، هل تستطيع الإجابة عليه؟",
            "targets": "بالتأكيد الإجابة الصحيحة هي ###.",
        }
    ]
}
