var prompts =
{
    "Sentiment Analysis": [
        {
            "inputs": "هل مشاعر الجملة التالية سلبية ، إيجابية ، أم محايدة : ###",
            "targets": "مشاعر الجملة السابقة ###.",
        },
        {
            "inputs": "لدينا الجملة التالية: ###. ماهي مشاعر الجملة السابقة؟",
            "targets": "الجملة السابقة تحتوي على مشاعر ###.",
        },
        {
            "inputs": "### ماهي مشاعر التغريدة السابقة؟",
            "targets": "التغريدة تحتوي على مشاعر ###.",
        },
        {
            "inputs": "كنت أقرأ في تويتر ووجدت الجملة التالية '###'. هل التغريدة السابقة إيجابية سلبية او محايدة؟",
            "targets": "التغريدة السابقة تعبر عن مشاعر ###.",
        },
        {
            "inputs": "إقرأ التغريدة التالية ###. ثم حلل مشاعرها.",
            "targets": "المشاعر في التغريدة السابقة ###.",
        },
    ],
    "Review Classification": [
        {
            "inputs": "هل مشاعر الجملة التالية سلبية ، إيجابية ، أم محايدة : ###",
            "targets": "مشاعر الجملة السابقة ###.",
        },
        {
            "inputs": "لدينا الجملة التالية: ###. ماهي مشاعر الجملة السابقة؟",
            "targets": "الجملة السابقة تحتوي على مشاعر ###.",
        },
        {
            "inputs": "### ماهي مشاعر المراجعة السابقة؟",
            "targets": "الجملة تحتوي على مشاعر ###.",
        },
        {
            "inputs": "كنت أقرأ في مراجعة ووجدت الجملة التالية '###'. هل المراجعة السابقة إيجابية سلبية او محايدة؟",
            "targets": "المراجعة السابقة تعبر عن مشاعر ###.",
        },
        {
            "inputs": "إقرأ المراجعة التالية ###. ثم حلل مشاعرها.",
            "targets": "المشاعر في المراجعة السابقة ###.",
        }
    ],
    "Rate Review Classification": [
        {
            "inputs": "هل مشاعر الجملة التالية سيئة جدا، سيئة، جيدة، جيدة جدا أم ممتازة : ###",
            "targets": "مشاعر الجملة السابقة ###.",
        },
        {
            "inputs": "لدينا الجملة التالية: ###. ماهو تقييم مشاعر الجملة السابقة؟",
            "targets": "الجملة السابقة تحتوي على مشاعر ###.",
        },
        {
            "inputs": "### قم بتقييم المراجعة التالية:",
            "targets": "الجملة تحتوي على مشاعر ###.",
        },
        {
            "inputs": "كنت أقرأ في مراجعة ووجدت الجملة التالية '###'. ماهو تقييم المراجعة من سيئة جداً إلى ممتازة؟",
            "targets": "المراجعة السابقة تعبر عن مشاعر ###.",
        },
        {
            "inputs": "إقرأ المراجعة التالية ###. ثم حلل مشاعرها.",
            "targets": "المشاعر في المراجعة السابقة ###.",
        }
    ],
    "Summarization": [
        {
            "inputs": "لخص المقال التالي: ###.",
            "targets": "حسناّ، هذا تلخيص للمقال '###'.",
        },
        {
            "inputs": "لدينا المقال التالي: ###. قم بتلخيصة!",
            "targets": "هذا تلخيص للمقال السابق: ###.",
        },
        {
            "inputs": "لدي مقال طويل، هلي يمكنك تلخيصه؟ ###.",
            "targets": "نعم بالتأكيد. هذا تلخيص للمقال السابق: ###.",
        },
        {
            "inputs": "قم بتلخيص المقال التالي: ###.",
            "targets": "هذا تلخيص للمقال: ###.",
        },
        {
            "inputs": "ليس لدي وقت لقراءة كل المقال التالي. إذا سمحت قم بتلخيصه: ###.",
            "targets": "يسعدني مساعدتك في ذلك. هنا تلخيص للمقال: ###.",
        },
    ],
    "Sarcasm detection": [
        {
            "inputs": "  هل التغريدة التالية ساخرة ، أم غير ساخرة: ###",
            "targets": "التغرية السابقة ###.",
        },
        {
            "inputs": "لدينا الجملة التالية: ###. هل هي ساخرة أم غير ساخرة؟",
            "targets": "الجملة السابقة ###.",
        },
        {
            "inputs": "كنت أقرأ في تويتر ووجدت الجملة التالية '###'. هل التغريدة السابقة ساخرة أم غير ساخرة؟",
            "targets": "التغريدة السابقة تعبر عن مشاعر ###.",
        },
        {
            "inputs": "إقرأ التغريدة التالية ###. ثم حلل سخريتها.",
            "targets": "المشاعر في التغريدة السابقة ###.",
        },
    ],
    "Question Answering": [
        {
            "inputs": "أجب على السؤال التالي : ###",
            "targets": "الإجابة الصحيحة هي ###."
        },
        {
            "inputs": "لدينا السؤال التالي: ### ، أجب عليه بطريقة مختصرة.",
            "targets": "حسناً، الإجابة هي ###",
        },
        {
            "inputs": "### أجب على السؤال السابق.",
            "targets": "الإجابة هي: ###",
        },
        {
            "inputs": "قم بالإجابة على السؤال التالي ###",
            "targets": "بالتأكيد، الإجابة هي ###.",
        },
        {
            "inputs": "وجدت هذا السؤال: ### في موقع ثقافي ، ماهي الإجابة؟",
            "targets": "الإجابة على السؤال هي ###.",
        }, {
            "inputs": "لدي هذا السؤال ### ، أجب عليه بطريقة مبسطة.",
            "targets": "حسناً. الإجابة هي ###.",
        },
        {
            "inputs": "بحثت في الإنترنت عن إجابة لهذا السؤال ###. لكني لم أجد إجابة ، هل تستطيع الإجابة عليه؟",
            "targets": "بالتأكيد الإجابة الصحيحة هي ###.",
        }
    ],
    "Nautral Language Inference": [
        {
            "inputs": "لدينا الجملتان '###' و '###'. هل تدل الجملتان على نفس المعنى؟",
            "targets": "###"
        },
        {
            "inputs": "الجملة الأولى: '###'. الجملة الثانية: '###'. الجملتان متوافقتان، متناقضتان، أم غير ذلك؟ ",
            "targets": "###"
        },
        {
            "inputs": "إذا كانت '###' صحيحة فإن '###' صحيحة؟ صح أم خطأ؟",
            "targets": "###"
        }
    ], "Alpaca": [
        {
            "inputs": "### ###",
            "targets": "###"
        }
    ],
    "QA Long Answers": [
        {
            "inputs": "قم بكتابة مقال يجيب على هذا السؤال ###.",
            "targets": "###",
        },
        {
            "inputs": "أجب على السؤال '###' بشكل مطول:",
            "targets": "###",
        }
    ],
    "QA with Context": [
        {
            "inputs": "قم بالإجابة على السؤال ### من النص التالي: ###.",
            "targets": "حسناً بإستخدام النص السابق الإجابة هي ###.",
        },
        {
            "inputs": "### أجب على السؤال السابق بإستخدام هذا النص: ###",
            "targets": "بالتأكيد الإجابة هي ###.",
        },
        {
            "inputs": "لدينا السؤال التالي: ###. أجب عليه بإستخدام النص التالي: ###.",
            "targets": "لقد قمت بقراءة النص. الإجابة هي ###.",
        }
    ],
    "Poetry Generation": [
        {
            "inputs": "قم بإنشاء ### من ###.",
            "targets": "###",
        },
        {
            "inputs": "أريد إنشاء ### من ###. هل يمكنك مساعدتي؟",
            "targets": "###",
        },
        {
            "inputs": "أريد أن أتعلم الشعر. أنشيء ### من ###.",
            "targets": "حسناً بالتأكيد: ###."
        },
        {
            "inputs": "هل يمكنك مساعدتي في إنشاء ### من ###؟",
            "targets": "بالطبع، تفضل هذه القصيدة: ###."
        }
    ],
    "Title Generation": [
        {
            "inputs": "لدينا النص التالي: ###. قم بإنشاء عنوان مناسب.",
            "targets": "###."
        },
        {
            "inputs": "أريد إيجاد عنوان مناسب للنص التالي: ###.",
            "targets": "###."
        },
        {
            "inputs": "ماهو العنوان المناسب للنص التالي: ###.",
            "targets": "حسناً قد يكون العنوان: '###' ، مناسباً."
        },
    ],
    "Diacritization": [
        {
            "inputs": "قم بتشكيل النص التالي: ###.",
            "targets": "حسناً. هذا تشكيل النص السابق: ###."
        },
        {
            "inputs": "ماهو تشكيل النص التالي: ###.",
            "targets": "###."
        },
        {
            "inputs": "لدي نص غير مشكل، قم بتشكيله: ###.",
            "targets": "النص المشكل: ###."
        },
    ],
    "Arithmitic": [
        {
            "inputs": "لدينا المسألة الرياضاية التالية: ###. قم بحلها.",
            "targets": "بالتأكيد، يمكن حلها كالتالي: ###."
        },
        {
            "inputs": "أجب على السؤال الرياضي التالي: ###.",
            "targets": "###."
        },
        {
            "inputs": "لدي مسألة رياضية ، قم بحلها بشكل مفصل: ###.",
            "targets": "حسناَ، هنا حل مفصل: ###."
        },
    ],
    "Story Completion": [
        {
            "inputs": "احكي لي قصة قصيرة ###.",
            "targets": "حسناً هنا قصة قصيرة: ###."
        },
        {
            "inputs": "اريد سماع قصة قبل النوم ، هل يمكنك أن تحكي لي قصة ###.",
            "targets": "###"
        },
    ]
}
